get color
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
  Since:  2017
 Syntax
  C#
public Color GetColor()
  Visual Basic
Public Function GetColor As Color
  Visual C++
public:
Color^ GetColor()
 Return Value
 color
 See Also
  ColorWithTransparency Class
  Autodesk.Revit.DB Namespace